oneBladeRotor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




libs
(
 "libmyMotions.so"
);

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt endTime;

endTime 15;
deltaT          0.00005;
writeControl    adjustableRunTime;

writeInterval   0.01; // 1.5;
adjustTimeStep  yes;
maxCo       40;
maxDeltaT   0.0018697; 

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;


functions
{
#include    "forces.allBlades"
}


OptimisationSwitches
{
    fileHandler collated;
}

// ************************************************************************* //

