oneBladeRotor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    airfoilDown
    {
        type            wall;
        inGroups        1(wall);
        nFaces          199;
        startFace       16672;
    }
    airfoilUp
    {
        type            wall;
        inGroups        1(wall);
        nFaces          199;
        startFace       16871;
    }
    farfield
    {
        type            patch;
        nFaces          44;
        startFace       17070;
    }
    BaseAndTop
    {
        type            empty;
        inGroups        1(empty);
        nFaces          22524;
        startFace       17114;
    }
)

// ************************************************************************* //
