oneBladeRotor/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    "fairing.*"
    {
        type            zeroGradient;
    }

    "inlet|outlet|topBottom|farfield"
    {
        type totalPressure;
        p0 $internalField;
    }

    "airfoil.*"
    {
        type            zeroGradient;
    }

    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
}

// ************************************************************************* //
