oneBladeRotor/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    "inlet|outlet|topBottom|farfield"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "fairing.*"
    {
        type            zeroGradient;
    }

    "airfoil.*"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
}


// ************************************************************************* //
